In [1]:
import pandas as pd
pd.set_option('display.max_rows', None)
#pd.set_option('display.max_columns', None)
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Harsh','Piyush','Daiwik', 'Dhyan', 'Het', 'Kesha'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

print("Original DataFrame:")
print(student_data)
print('\nSplit the said data on school_code wise:')
result = student_data.groupby(['school_code'])
for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)
print("\nType of the object:")
print(type(result))

Original DataFrame:
   school_code class    name date_Of_Birth   age  height  weight  address
S1        s001     V   Harsh     15/05/2002   12     173      35  street1
S2        s002     V  Piyush     17/05/2002   12     192      32  street2
S3        s003    VI  Daiwik     16/02/1999   13     186      33  street3
S4        s001    VI   Dhyan     25/09/1998   13     167      30  street1
S5        s002     V     Het     11/05/2002   14     151      31  street2
S6        s004    VI   Kesha     15/09/1997   12     159      32  street4

Split the said data on school_code wise:

Group:
('s001',)
   school_code class   name date_Of_Birth   age  height  weight  address
S1        s001     V  Harsh     15/05/2002   12     173      35  street1
S4        s001    VI  Dhyan     25/09/1998   13     167      30  street1

Group:
('s002',)
   school_code class    name date_Of_Birth   age  height  weight  address
S2        s002     V  Piyush     17/05/2002   12     192      32  street2
S5        s002     V     Het     11/05/2002   14     151      31  street2

Group:
('s003',)
   school_code class    name date_Of_Birth   age  height  weight  address
S3        s003    VI  Daiwik     16/02/1999   13     186      33  street3

Group:
('s004',)
   school_code class   name date_Of_Birth   age  height  weight  address
S6        s004    VI  Kesha     15/09/1997   12     159      32  street4

Type of the object:
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [2]:
print("Original DataFrame:")
print(student_data)
print('\nMean, min, and max value of age for each value of the school:')
grouped_single = student_data.groupby('school_code').agg({'age': ['mean', 'min', 'max']})
print(grouped_single)

Original DataFrame:
   school_code class    name date_Of_Birth   age  height  weight  address
S1        s001     V   Harsh     15/05/2002   12     173      35  street1
S2        s002     V  Piyush     17/05/2002   12     192      32  street2
S3        s003    VI  Daiwik     16/02/1999   13     186      33  street3
S4        s001    VI   Dhyan     25/09/1998   13     167      30  street1
S5        s002     V     Het     11/05/2002   14     151      31  street2
S6        s004    VI   Kesha     15/09/1997   12     159      32  street4

Mean, min, and max value of age for each value of the school:
              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

In [3]:
print('\nSplit the said data on school_code, class wise:')
result = student_data.groupby(['school_code', 'class'])
for name,group in result:
    print("\nGroup:")
    print(name)
    print(group)

Split the said data on school_code, class wise:

Group:
('s001', 'V')
   school_code class   name date_Of_Birth   age  height  weight  address
S1        s001     V  Harsh     15/05/2002   12     173      35  street1

Group:
('s001', 'VI')
   school_code class   name date_Of_Birth   age  height  weight  address
S4        s001    VI  Dhyan     25/09/1998   13     167      30  street1

Group:
('s002', 'V')
   school_code class    name date_Of_Birth   age  height  weight  address
S2        s002     V  Piyush     17/05/2002   12     192      32  street2
S5        s002     V     Het     11/05/2002   14     151      31  street2

Group:
('s003', 'VI')
   school_code class    name date_Of_Birth   age  height  weight  address
S3        s003    VI  Daiwik     16/02/1999   13     186      33  street3

Group:
('s004', 'VI')
   school_code class   name date_Of_Birth   age  height  weight  address
S6        s004    VI  Kesha     15/09/1997   12     159      32  street4

In [4]:
print('\nCast grouping as a list:')
result = student_data.groupby(['school_code'])
print(list(result))

Cast grouping as a list:
[(('s001',),    school_code class   name date_Of_Birth   age  height  weight  address
S1        s001     V  Harsh     15/05/2002   12     173      35  street1
S4        s001    VI  Dhyan     25/09/1998   13     167      30  street1), (('s002',),    school_code class    name date_Of_Birth   age  height  weight  address
S2        s002     V  Piyush     17/05/2002   12     192      32  street2
S5        s002     V     Het     11/05/2002   14     151      31  street2), (('s003',),    school_code class    name date_Of_Birth   age  height  weight  address
S3        s003    VI  Daiwik     16/02/1999   13     186      33  street3), (('s004',),    school_code class   name date_Of_Birth   age  height  weight  address
S6        s004    VI  Kesha     15/09/1997   12     159      32  street4)]

In [5]:
print('\nSplit the said data on school_code wise:')
grouped_single = student_data.groupby(['school_code'])
print("Size of the grouped data - single column")
print(grouped_single.size())
print('\nSplit the said data on school_code and class wise:')

grouped_mul = student_data.groupby(['school_code', 'class'])
print("Size of the grouped data - multiple columns:")
print(grouped_mul.size())

Split the said data on school_code wise:
Size of the grouped data - single column
school_code
s001    2
s002    2
s003    1
s004    1
dtype: int64

Split the said data on school_code and class wise:
Size of the grouped data - multiple columns:
school_code  class
s001         V        1
             VI       1
s002         V        2
s003         VI       1
s004         VI       1
dtype: int64